In [10]:
import pandas as pd
import sklearn as sk
from sklearn.datasets import load_iris

In [11]:
arquivo = pd.read_csv('datasheet.csv')

In [12]:
data = load_iris()

In [8]:
arquivo.head()

                 Nome           Profissao   Salario Aniversario
0          Levi Alves       Técnico de TI  14230.17         NaN
1  Ana Carolina Porto           Psicólogo  11254.39  1970-05-15
2      Benício Guerra    Designer Gráfico   2994.43  1995-11-06
3  João Gabriel Rocha  Cientista de Dados  14660.56  1966-10-24
4      Gabriel Vieira           Arquiteto  12816.50         NaN

In [9]:
arquivo.isna().sum()

Nome           0
Profissao      0
Salario        0
Aniversario    2
dtype: int64

In [10]:
moda = arquivo["Aniversario"].value_counts().index[0]

In [11]:
arquivo["Aniversario"].fillna(moda, inplace=True)

In [12]:
arquivo.head()

                 Nome           Profissao   Salario Aniversario
0          Levi Alves       Técnico de TI  14230.17  1970-05-15
1  Ana Carolina Porto           Psicólogo  11254.39  1970-05-15
2      Benício Guerra    Designer Gráfico   2994.43  1995-11-06
3  João Gabriel Rocha  Cientista de Dados  14660.56  1966-10-24
4      Gabriel Vieira           Arquiteto  12816.50  1970-05-15

In [14]:
arquivo.shape
#número de linhas e colunas

(50, 4)

In [13]:
df_arquivo = pd.DataFrame(arquivo)

In [ ]:
df = pd.DataFrame(data['data'], columns=data['feature_names'])
df['species'] = data['target']   
df.head()

NameError: name 'pd' is not defined

In [1]:
df.plot.scatter(x='sepal length (cm)', y='sepal width (cm)')

NameError: name 'df' is not defined

In [21]:
df.groupby('species').mean()

,sepal length (cm),sepal width (cm),petal length (cm),petal width (cm)
species,,,,
0,5.006,3.428,1.462,0.246
1,5.936,2.770,4.260,1.326
2,6.588,2.974,5.552,2.026